src/Documents/ЗаказНаряд/ЗаказНаряд.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ЗаказНаряд</name>
  <registerRecords>AccumulationRegister.МатериалыЗаказчиков</registerRecords>
  <registerRecords>AccumulationRegister.ЗаказыКлиентов</registerRecords>
  <attributes>
    <name>Клиент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Автомобиль</name>
    <type>
      <types>CatalogRef.Автомобили</types>
    </type>
  </attributes>
  <attributes>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаЗаписи</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>СостояниеЗаказа</name>
    <type>
      <types>EnumRef.СостоянияЗаказовНарядов</types>
    </type>
  </attributes>
  <attributes>
    <name>ОписаниеПроблемыЗаказчиком</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ОписаниеПроблемыМастером</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДокумента</name>
    <type>
      <types>DefinedType.ФинансовыеДанные</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Реквизит1</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Услуги</name>
    <attributes>
      <name>Услуга</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>DefinedType.ФинансовыеДанные</types>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>DefinedType.ФинансовыеДанные</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>МатериалыЗаказчика</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СостояниеМатериала</name>
      <type>
        <types>EnumRef.СостояниеМатериаловКлиента</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/Documents/ЗаказНаряд/Forms/ФормаДокумента/Module.bsl
// Форма документа "ЗаказНаряд".
// Обеспечивает интерактивное заполнение, автоподстановку цены услуги,
// пересчёт сумм в строках и итоговой суммы документа.

// ============================================================
//  Серверные обработчики
// ============================================================

// При создании нового документа на сервере:
//   - Если ответственный не заполнен, подставляем текущего пользователя
//     из параметров сеанса (ссылка на элемент справочника "Пользователи").
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)  Экспорт
    Если Не ЗначениеЗаполнено(Объект.Ответственный) Тогда
        Объект.Ответственный = ПараметрыСеанса.ТекущийПользователь;
    КонецЕсли;
КонецПроцедуры

// ============================================================
//  Клиентские процедуры пересчёта итоговой суммы документа
// ============================================================

// Пересчитывает итоговую сумму документа как сумму колонки "Сумма"
// табличной части "Услуги".
&НаКлиенте
Процедура ПересчётСуммыДокумента()
    Объект.СуммаДокумента = Объект.Услуги.Итог("Сумма");
КонецПроцедуры   

// ============================================================
//  Обработчики табличной части "Услуги"
// ============================================================

// Изменение количества в строке услуги:
//   - пересчитываем сумму в строке (Цена * Количество) через общий модуль,
//   - обновляем итоговую сумму документа.
&НаКлиенте
Процедура УслугиКоличествоПриИзменении(Элемент)
    СтрокаТЧ = Элементы.Услуги.ТекущиеДанные;
    Если СтрокаТЧ <> Неопределено Тогда
        РаботаСТабличнымиЧастямиКлиент.ПересчитатьСуммуВСтрокеТабличнойЧасти(СтрокаТЧ);
        ПересчётСуммыДокумента();
    КонецЕсли;
КонецПроцедуры   

// Изменение цены в строке услуги – аналогично пересчитываем строку и итог.
&НаКлиенте
Процедура УслугиЦенаПриИзменении(Элемент)
    СтрокаТЧ = Элементы.Услуги.ТекущиеДанные;
    Если СтрокаТЧ <> Неопределено Тогда
        РаботаСТабличнымиЧастямиКлиент.ПересчитатьСуммуВСтрокеТабличнойЧасти(СтрокаТЧ);
        ПересчётСуммыДокумента();
    КонецЕсли;
КонецПроцедуры

// При выборе услуги в строке:
//   - если услуга выбрана, получаем её розничную цену на дату документа
//     с помощью функции общего модуля (серверный вызов);
//   - если услуга сброшена, цена обнуляется;
//   - пересчитываем сумму строки и итоговую сумму документа.
&НаКлиенте
Процедура УслугиУслугаПриИзменении(Элемент)      
    СтрокаТЧ = Элементы.Услуги.ТекущиеДанные;  
    Если ЗначениеЗаполнено(СтрокаТЧ.Услуга) Тогда 
        СтрокаТЧ.Цена = РаботаСЦенами.ПолучитьЦенуПродажиНаДату(СтрокаТЧ.Услуга,,Объект.Дата);
    Иначе
        СтрокаТЧ.Цена = 0; 
    КонецЕсли;  
    РаботаСТабличнымиЧастямиКлиент.ПересчитатьСуммуВСтрокеТабличнойЧасти(СтрокаТЧ);
    ПересчётСуммыДокумента();
КонецПроцедуры

// После удаления строки услуги пересчитываем итоговую сумму.
&НаКлиенте
Процедура УслугиПослеУдаления(Элемент)
    ПересчётСуммыДокумента();
КонецПроцедуры

// При начале редактирования новой строки (копирование существующей):
//   - итоговая сумма пересчитывается, так как добавляется новая строка с ненулевой суммой.
&НаКлиенте
Процедура УслугиПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
    Если Копирование Тогда
        ПересчётСуммыДокумента(); 
    КонецЕсли;
КонецПроцедуры
